; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_5_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 - counter
	)
  (:init
		(= (value c0) 67)
	(= (value c1) 25)
	(= (value c2) 19)
	(= (value c3) 23)
	(= (value c4) 82)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 4
2. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 4
3. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 4
4. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 2 of 4
5. (increment c2)
   changed: (value c2) from 19 to 23
   goals met: 1 of 4
6. (increment c2)
   changed: (value c2) from 23 to 27
   goals met: 2 of 4
7. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 2 of 4
8. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 2 of 4
9. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 2 of 4
10. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 2 of 4
11. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 2 of 4
12. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 2 of 4
13. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 2 of 4
14. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 2 of 4
15. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 2 of 4
16. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 2 of 4
17. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 2 of 4
18. (increment c1)
   changed: (value c1) from 25 to 32
   goals met: 1 of 4
19. (decrement c2)
   changed: (value c2) from 27 to 22
   goals met: 2 of 4
20. (increment c1)
   changed: (value c1) from 32 to 39
   goals met: 2 of 4
21. (increment c1)
   changed: (value c1) from 39 to 46
   goals met: 2 of 4
22. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 2 of 4
23. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 2 of 4
24. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 2 of 4
25. (increment c2)
   changed: (value c2) from 22 to 27
   goals met: 1 of 4
26. (increment c1)
   changed: (value c1) from 46 to 56
   goals met: 1 of 4
27. (decrement c2)
   changed: (value c2) from 27 to 22
   goals met: 2 of 4
28. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 2 of 4
29. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 2 of 4
30. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 2 of 4
31. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 2 of 4
32. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 2 of 4
33. (increment c2)
   changed: (value c2) from 22 to 32
   goals met: 1 of 4
34. (increment c1)
   changed: (value c1) from 56 to 66
   goals met: 1 of 4
35. (decrement c0)
   changed: (value c0) from 67 to 64
   goals met: 2 of 4
36. (decrement c2)
   changed: (value c2) from 32 to 22
   goals met: 3 of 4
37. (decrement c1)
   changed: (value c1) from 66 to 56
   goals met: 2 of 4
38. (decrement c0)
   changed: (value c0) from 64 to 61
   goals met: 2 of 4
39. (decrement c0)
   changed: (value c0) from 61 to 58
   goals met: 2 of 4
40. (decrement c0)
   changed: (value c0) from 58 to 55
   goals met: 3 of 4
41. (increment c2)
   changed: (value c2) from 22 to 32
   goals met: 2 of 4
42. (decrement c1)
   changed: (value c1) from 56 to 46
   goals met: 1 of 4
43. (decrement c0)
   changed: (value c0) from 55 to 52
   goals met: 1 of 4
44. (decrement c0)
   changed: (value c0) from 52 to 49
   goals met: 1 of 4
45. (decrement c0)
   changed: (value c0) from 49 to 46
   goals met: 1 of 4
46. (decrement c0)
   changed: (value c0) from 46 to 43
   goals met: 2 of 4
47. (decrement c2)
   changed: (value c2) from 32 to 22
   goals met: 3 of 4
48. (decrement c1)
   changed: (value c1) from 46 to 36
   goals met: 2 of 4
49. (decrement c0)
   changed: (value c0) from 43 to 40
   goals met: 2 of 4
50. (decrement c0)
   changed: (value c0) from 40 to 37
   goals met: 2 of 4
51. (decrement c0)
   changed: (value c0) from 37 to 34
   goals met: 3 of 4
52. (increment c2)
   changed: (value c2) from 22 to 32
   goals met: 2 of 4
53. (decrement c1)
   changed: (value c1) from 36 to 26
   goals met: 2 of 4
54. (decrement c0)
   changed: (value c0) from 34 to 31
   goals met: 2 of 4
55. (decrement c0)
   changed: (value c0) from 31 to 28
   goals met: 2 of 4
56. (decrement c0)
   changed: (value c0) from 28 to 25
   goals met: 3 of 4
57. (decrement c2)
   changed: (value c2) from 32 to 22
   goals met: 3 of 4
58. (decrement c1)
   changed: (value c1) from 26 to 16
   goals met: 3 of 4
59. (decrement c0)
   changed: (value c0) from 25 to 22
   goals met: 3 of 4
60. (decrement c0)
   changed: (value c0) from 22 to 19
   goals met: 3 of 4
61. (decrement c0)
   changed: (value c0) from 19 to 16
   goals met: 3 of 4
62. (decrement c0)
   changed: (value c0) from 16 to 13
   goals met: 4 of 4
